<?php
/**
 * Created by PhpStorm.
 * User: User
 * Date: 29.08.2017
 * Time: 20:25
 */
const DB_NAME = "test";
###############################################################################

echo "Hello world";

###############################################################################

$aray = aray(); #  масив
$aray = [2, 5];
    function logarifm(float $param, array $test) : int {
    return $param;} # такая запись работает только в 7 + верисии

& # ссылка (амперсант)

###############################################################################

unset ($k);# очищает переменную как только ссылка пропадает ссылка = указатель

###############################################################################

$b = "k";

###############################################################################

$$ b; #cыдка на имя переменной

###############################################################################

var_dump($k); # выводит всю инфу о переменной

###############################################################################

$k = 5;
if($k == 3) {
    $b = 4;
}
else {
   $b=1;
}

###############################################################################

if($userGroup == "admin"){
    if ($userPassword == "superadmin"){
     $access === true;
    } else {
        $access == false;
    }
}
elseif($userGroup == "moderator") {
    if ($userGroup == "moderator") {
        if ($userPassword == "moderator") {
            $access === true;
        } else {
            $access == false;
        }
    }
}